RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_PUF.h
#define PUF_INTSTAT_KEYINREQ_MASK                (0x10U)
#define PUF_INTSTAT_KEYINREQ_SHIFT               (4U)
/*! KEYINREQ - PUF Key Input Register Interrupt Status
 *  0b0..No request for next part of key
 *  0b1..Request for next part of key
 */
#define PUF_INTSTAT_KEYINREQ(x)                  (((uint32_t)(((uint32_t)(x)) << PUF_INTSTAT_KEYINREQ_SHIFT)) & PUF_INTSTAT_KEYINREQ_MASK)

#define PUF_INTSTAT_KEYOUTAVAIL_MASK             (0x20U)
#define PUF_INTSTAT_KEYOUTAVAIL_SHIFT            (5U)
/*! KEYOUTAVAIL - PUF Key Output Register Interrupt Status
 *  0b0..Next part of key is not available
 *  0b1..Next part of key is available
 */
#define PUF_INTSTAT_KEYOUTAVAIL(x)               (((uint32_t)(((uint32_t)(x)) << PUF_INTSTAT_KEYOUTAVAIL_SHIFT)) & PUF_INTSTAT_KEYOUTAVAIL_MASK)

#define PUF_INTSTAT_CODEINREQ_MASK               (0x40U)
#define PUF_INTSTAT_CODEINREQ_SHIFT              (6U)
/*! CODEINREQ - PUF Code Input Register Interrupt Status
 *  0b0..No request for next part of AC/KC
 *  0b1..Request for next part of AC/KC
 */
#define PUF_INTSTAT_CODEINREQ(x)                 (((uint32_t)(((uint32_t)(x)) << PUF_INTSTAT_CODEINREQ_SHIFT)) & PUF_INTSTAT_CODEINREQ_MASK)

#define PUF_INTSTAT_CODEOUTAVAIL_MASK            (0x80U)
#define PUF_INTSTAT_CODEOUTAVAIL_SHIFT           (7U)
/*! CODEOUTAVAIL - PUF Code Output Register Interrupt Status
 *  0b0..Next part of AC/KC is not available
 *  0b1..Next part of AC/KC is available
 */
#define PUF_INTSTAT_CODEOUTAVAIL(x)              (((uint32_t)(((uint32_t)(x)) << PUF_INTSTAT_CODEOUTAVAIL_SHIFT)) & PUF_INTSTAT_CODEOUTAVAIL_MASK)
/*! @} */

/*! @name PWRCTRL - PUF Power Control Of RAM */
/*! @{ */

#define PUF_PWRCTRL_RAM_ON_MASK                  (0x1U)
#define PUF_PWRCTRL_RAM_ON_SHIFT                 (0U)
/*! RAM_ON - PUF RAM on
 *  0b0..PUF RAM is in sleep mode (PUF operation disabled)
 *  0b1..PUF RAM is awake (normal PUF operation enabled)
 */
#define PUF_PWRCTRL_RAM_ON(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_PWRCTRL_RAM_ON_SHIFT)) & PUF_PWRCTRL_RAM_ON_MASK)

#define PUF_PWRCTRL_CK_DIS_MASK                  (0x4U)
#define PUF_PWRCTRL_CK_DIS_SHIFT                 (2U)
/*! CK_DIS - Clock disable
 *  0b0..PUF RAM is clocked (normal PUF operation enabled)
 *  0b1..PUF RAM clock is gated/disabled (PUF operation disabled)
 */
#define PUF_PWRCTRL_CK_DIS(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_PWRCTRL_CK_DIS_SHIFT)) & PUF_PWRCTRL_CK_DIS_MASK)

#define PUF_PWRCTRL_RAM_INITN_MASK               (0x8U)
#define PUF_PWRCTRL_RAM_INITN_SHIFT              (3U)
/*! RAM_INITN - RAM initialization
 *  0b0..Reset the PUF RAM (PUF operation disabled)
 *  0b1..Do not reset the PUF RAM (normal PUF operation enabled)
 */
#define PUF_PWRCTRL_RAM_INITN(x)                 (((uint32_t)(((uint32_t)(x)) << PUF_PWRCTRL_RAM_INITN_SHIFT)) & PUF_PWRCTRL_RAM_INITN_MASK)

#define PUF_PWRCTRL_RAM_PSW_MASK                 (0xF0U)
#define PUF_PWRCTRL_RAM_PSW_SHIFT                (4U)
/*! RAM_PSW - PUF RAM power switches */
#define PUF_PWRCTRL_RAM_PSW(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_PWRCTRL_RAM_PSW_SHIFT)) & PUF_PWRCTRL_RAM_PSW_MASK)
/*! @} */

/*! @name CFG - PUF Configuration Register */
/*! @{ */

#define PUF_CFG_PUF_BLOCK_SET_KEY_MASK           (0x1U)
#define PUF_CFG_PUF_BLOCK_SET_KEY_SHIFT          (0U)
/*! PUF_BLOCK_SET_KEY - PUF Block Set Key Disable
 *  0b0..Enable the Set Key state
 *  0b1..Disable the Set Key state
 */
#define PUF_CFG_PUF_BLOCK_SET_KEY(x)             (((uint32_t)(((uint32_t)(x)) << PUF_CFG_PUF_BLOCK_SET_KEY_SHIFT)) & PUF_CFG_PUF_BLOCK_SET_KEY_MASK)

#define PUF_CFG_PUF_BLOCK_ENROLL_MASK            (0x2U)
#define PUF_CFG_PUF_BLOCK_ENROLL_SHIFT           (1U)
/*! PUF_BLOCK_ENROLL - PUF Block Enroll Disable
 *  0b0..Enable the Enrollment state
 *  0b1..Disable the Enrollment state
 */
#define PUF_CFG_PUF_BLOCK_ENROLL(x)              (((uint32_t)(((uint32_t)(x)) << PUF_CFG_PUF_BLOCK_ENROLL_SHIFT)) & PUF_CFG_PUF_BLOCK_ENROLL_MASK)
/*! @} */

/*! @name KEYLOCK - PUF Key Manager Lock */
/*! @{ */

#define PUF_KEYLOCK_LOCK0_MASK                   (0x3U)
#define PUF_KEYLOCK_LOCK0_SHIFT                  (0U)
/*! LOCK0 - Lock Block 0
 *  0b00..SNVS Key block locked
 *  0b01..SNVS Key block locked
 *  0b10..SNVS Key block unlocked
 *  0b11..SNVS Key block locked
 */
#define PUF_KEYLOCK_LOCK0(x)                     (((uint32_t)(((uint32_t)(x)) << PUF_KEYLOCK_LOCK0_SHIFT)) & PUF_KEYLOCK_LOCK0_MASK)

#define PUF_KEYLOCK_LOCK1_MASK                   (0xCU)
#define PUF_KEYLOCK_LOCK1_SHIFT                  (2U)
/*! LOCK1 - Lock Block 1
 *  0b00..OTFAD Key block locked
 *  0b01..OTFAD Key block locked
 *  0b10..OTFAD Key block unlocked
 *  0b11..OTFAD Key block locked
 */
#define PUF_KEYLOCK_LOCK1(x)                     (((uint32_t)(((uint32_t)(x)) << PUF_KEYLOCK_LOCK1_SHIFT)) & PUF_KEYLOCK_LOCK1_MASK)
/*! @} */

/*! @name KEYENABLE - PUF Key Manager Enable */
/*! @{ */

#define PUF_KEYENABLE_ENABLE0_MASK               (0x3U)
#define PUF_KEYENABLE_ENABLE0_SHIFT              (0U)
/*! ENABLE0 - Enable Block 0
 *  0b00..Key block 0 disabled
 *  0b01..Key block 0 disabled
 *  0b10..Key block 0 enabled
 *  0b11..Key block 0 disabled
 */
#define PUF_KEYENABLE_ENABLE0(x)                 (((uint32_t)(((uint32_t)(x)) << PUF_KEYENABLE_ENABLE0_SHIFT)) & PUF_KEYENABLE_ENABLE0_MASK)

#define PUF_KEYENABLE_ENABLE1_MASK               (0xCU)
#define PUF_KEYENABLE_ENABLE1_SHIFT              (2U)
/*! ENABLE1 - Enable Block 1
 *  0b00..Key block 1 disabled
 *  0b01..Key block 1 disabled
 *  0b10..Key block 1 enabled
 *  0b11..Key block 1 disabled
 */
#define PUF_KEYENABLE_ENABLE1(x)                 (((uint32_t)(((uint32_t)(x)) << PUF_KEYENABLE_ENABLE1_SHIFT)) & PUF_KEYENABLE_ENABLE1_MASK)
/*! @} */

/*! @name KEYRESET - PUF Key Manager Reset */
/*! @{ */

#define PUF_KEYRESET_RESET0_MASK                 (0x3U)
#define PUF_KEYRESET_RESET0_SHIFT                (0U)
/*! RESET0 - Reset Block 0
 *  0b00..Do not reset key block 0
 *  0b01..Do not reset key block 0
 *  0b10..Reset key block 0
 *  0b11..Do not reset key block 0
 */
#define PUF_KEYRESET_RESET0(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_KEYRESET_RESET0_SHIFT)) & PUF_KEYRESET_RESET0_MASK)

#define PUF_KEYRESET_RESET1_MASK                 (0xCU)
#define PUF_KEYRESET_RESET1_SHIFT                (2U)
/*! RESET1 - Reset Block 1
 *  0b00..Do not reset key block 1
 *  0b01..Do not reset key block 1
 *  0b10..Reset key block 1
 *  0b11..Do not reset key block 1
 */
#define PUF_KEYRESET_RESET1(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_KEYRESET_RESET1_SHIFT)) & PUF_KEYRESET_RESET1_MASK)
/*! @} */

/*! @name IDXBLK - PUF Index Block Key Output */
/*! @{ */

