RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_PUF.h
#define PUF_IDXBLK_DP_IDXBLK_DP9_MASK            (0xC0000U)
#define PUF_IDXBLK_DP_IDXBLK_DP9_SHIFT           (18U)
/*! IDXBLK_DP9 - idxblk_dp9 */
#define PUF_IDXBLK_DP_IDXBLK_DP9(x)              (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP9_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP9_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP10_MASK           (0x300000U)
#define PUF_IDXBLK_DP_IDXBLK_DP10_SHIFT          (20U)
/*! IDXBLK_DP10 - idxblk_dp10 */
#define PUF_IDXBLK_DP_IDXBLK_DP10(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP10_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP10_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP11_MASK           (0xC00000U)
#define PUF_IDXBLK_DP_IDXBLK_DP11_SHIFT          (22U)
/*! IDXBLK_DP11 - idxblk_dp11 */
#define PUF_IDXBLK_DP_IDXBLK_DP11(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP11_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP11_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP12_MASK           (0x3000000U)
#define PUF_IDXBLK_DP_IDXBLK_DP12_SHIFT          (24U)
/*! IDXBLK_DP12 - idxblk_dp12 */
#define PUF_IDXBLK_DP_IDXBLK_DP12(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP12_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP12_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP13_MASK           (0xC000000U)
#define PUF_IDXBLK_DP_IDXBLK_DP13_SHIFT          (26U)
/*! IDXBLK_DP13 - idxblk_dp13 */
#define PUF_IDXBLK_DP_IDXBLK_DP13(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP13_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP13_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP14_MASK           (0x30000000U)
#define PUF_IDXBLK_DP_IDXBLK_DP14_SHIFT          (28U)
/*! IDXBLK_DP14 - idxblk_dp14 */
#define PUF_IDXBLK_DP_IDXBLK_DP14(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP14_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP14_MASK)

#define PUF_IDXBLK_DP_IDXBLK_DP15_MASK           (0xC0000000U)
#define PUF_IDXBLK_DP_IDXBLK_DP15_SHIFT          (30U)
/*! IDXBLK_DP15 - idxblk_dp15 */
#define PUF_IDXBLK_DP_IDXBLK_DP15(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDXBLK_DP15_SHIFT)) & PUF_IDXBLK_DP_IDXBLK_DP15_MASK)
/*! @} */

/*! @name KEYMASK - PUF Key Block 0 Mask Enable..PUF Key Block 1 Mask Enable */
/*! @{ */

#define PUF_KEYMASK_KEYMASK_MASK                 (0xFFFFFFFFU)
#define PUF_KEYMASK_KEYMASK_SHIFT                (0U)
/*! KEYMASK - KEYMASK1 */
#define PUF_KEYMASK_KEYMASK(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_KEYMASK_KEYMASK_SHIFT)) & PUF_KEYMASK_KEYMASK_MASK)
/*! @} */

/*! @name IDXBLK_STATUS - PUF Index Block Setting Status Register */
/*! @{ */

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS0_MASK    (0x3U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS0_SHIFT   (0U)
/*! IDXBLK_STATUS0 - idxblk_status0 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS0(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS0_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS0_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS1_MASK    (0xCU)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS1_SHIFT   (2U)
/*! IDXBLK_STATUS1 - idxblk_status1 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS1(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS1_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS1_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS2_MASK    (0x30U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS2_SHIFT   (4U)
/*! IDXBLK_STATUS2 - idxblk_status2 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS2(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS2_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS2_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS3_MASK    (0xC0U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS3_SHIFT   (6U)
/*! IDXBLK_STATUS3 - idxblk_status3 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS3(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS3_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS3_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS4_MASK    (0x300U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS4_SHIFT   (8U)
/*! IDXBLK_STATUS4 - idxblk_status4 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS4(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS4_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS4_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS5_MASK    (0xC00U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS5_SHIFT   (10U)
/*! IDXBLK_STATUS5 - idxblk_status5 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS5(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS5_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS5_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS6_MASK    (0x3000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS6_SHIFT   (12U)
/*! IDXBLK_STATUS6 - idxblk_status6 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS6(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS6_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS6_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS7_MASK    (0xC000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS7_SHIFT   (14U)
/*! IDXBLK_STATUS7 - idxblk_status7 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS7(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS7_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS7_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS8_MASK    (0x30000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS8_SHIFT   (16U)
/*! IDXBLK_STATUS8 - idxblk_status8 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS8(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS8_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS8_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS9_MASK    (0xC0000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS9_SHIFT   (18U)
/*! IDXBLK_STATUS9 - idxblk_status9 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS9(x)      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS9_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS9_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS10_MASK   (0x300000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS10_SHIFT  (20U)
/*! IDXBLK_STATUS10 - idxblk_status10 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS10(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS10_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS10_MASK)

