RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/periph/PERI_PUF.h
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS11_MASK   (0xC00000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS11_SHIFT  (22U)
/*! IDXBLK_STATUS11 - idxblk_status11 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS11(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS11_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS11_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS12_MASK   (0x3000000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS12_SHIFT  (24U)
/*! IDXBLK_STATUS12 - idxblk_status12 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS12(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS12_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS12_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS13_MASK   (0xC000000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS13_SHIFT  (26U)
/*! IDXBLK_STATUS13 - idxblk_status13 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS13(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS13_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS13_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS14_MASK   (0x30000000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS14_SHIFT  (28U)
/*! IDXBLK_STATUS14 - idxblk_status14 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS14(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS14_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS14_MASK)

#define PUF_IDXBLK_STATUS_IDXBLK_STATUS15_MASK   (0xC0000000U)
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS15_SHIFT  (30U)
/*! IDXBLK_STATUS15 - idxblk_status15 */
#define PUF_IDXBLK_STATUS_IDXBLK_STATUS15(x)     (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDXBLK_STATUS15_SHIFT)) & PUF_IDXBLK_STATUS_IDXBLK_STATUS15_MASK)
/*! @} */

/*! @name IDXBLK_SHIFT - PUF Key Manager Shift Status */
/*! @{ */

#define PUF_IDXBLK_SHIFT_IND_KEY0_MASK           (0xFU)
#define PUF_IDXBLK_SHIFT_IND_KEY0_SHIFT          (0U)
/*! IND_KEY0 - Index of key space in block 0 */
#define PUF_IDXBLK_SHIFT_IND_KEY0(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_SHIFT_IND_KEY0_SHIFT)) & PUF_IDXBLK_SHIFT_IND_KEY0_MASK)

#define PUF_IDXBLK_SHIFT_IND_KEY1_MASK           (0xF0U)
#define PUF_IDXBLK_SHIFT_IND_KEY1_SHIFT          (4U)
/*! IND_KEY1 - Index of key space in block 1 */
#define PUF_IDXBLK_SHIFT_IND_KEY1(x)             (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_SHIFT_IND_KEY1_SHIFT)) & PUF_IDXBLK_SHIFT_IND_KEY1_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PUF_Register_Masks */


/*!
 * @}
 */ /* end of group PUF_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_PUF_H_ */

